let handler = async (m, { command, text }) => m.reply(`*╔═╼─╾─╾═【🕸️】═╼─╾╾─╾═╗*
*رد تــلــقــائــي🧑🏻‍💻*
*❦الاستمارة┋📜』*
*✥━─━─━✾◜🍁◞✾━─━─━✥*
*✧ الـلـقـب ┋👤┋⇜〘 〙*

*✧ مـن انـمــي؟┋🍃┋⇜〘 〙*

*✧ الولــد او بـنـت؟┋🥷┋⇜〘〙*

*✧ مــن طـــرف┋🖇️┋⇜〘 〙*
*✥━─━─━✾◜🍁◞✾━─━─━✥*

*⧉⇄اختر نقابة ┆*

*➊ ⇜مـارفـل 🀄️ ⇄* 
*➋ ⇜دراغـون 🐉 ⇄*
❸ ⇜ *اكرمان*   ⛩️ *⇄* 
*⧉ رقم النقابة الي اخترتها ⇜〘〙*

*⧉⇄┆✨「تـوقــيع الإدارة ✒️」*
『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』
*✦━━━━━━[ *𝑺𝐻𝐴𝐷𝛩𝑊 𝐵𝛩𝑇* ]━━━━━━✦`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|1|استماره\استمارة)$/i

export default handler
